
// обработчик Начало выбора

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Фильтр = НСтр("ru = 'Текст'; en = 'Text'") + "(*.txt)|*.txt" ;
	Диалог.Фильтр = Фильтр;
	Диалог.Заголовок = "Выберите файл Графика";
	
	
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы)не выбран!'; en = 'File(s) not selected !'"))
	КонецЕсли;
	
КонецПроцедуры

