
// обработчик Начало выбора

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Фильтр = НСтр("ru = 'Текст'; en = 'Text'") + "(*.txt)|*.txt" ;
	Диалог.Фильтр = Фильтр;
	Диалог.Заголовок = "Выберите файл Графика";
	
	
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы)не выбран!'; en = 'File(s) not selected !'"))
	КонецЕсли;

	
КонецПроцедуры

// Обработчик нажатия Кнопки

&НаСервере
Процедура ЗаполнитьИзФайлаНаСервере()
	
	
	// создаем
	ТекстДок = Новый ТекстовыйДокумент; 
	//  читаем
	ТекстДок.Прочитать(ИмяФайла);    
	
	// очищаем ТЧ
	Объект.РаботаССекретностью.Очистить(); 
	
	// итератор	
	НомерСтроки = 1; 
	
	// Цикл по строкам Документа	
	Пока НомерСтроки <= ТекстДок.КоличествоСтрок() Цикл
		
		// текущая строка
		ТекСтрока = ТекстДок.ПолучитьСтроку(НомерСтроки); 
		
		// разделяем
		МассивСтроки = СтрРазделить(ТекСтрока, ";" );
		
		// строка ТЧ
		СтрокаТЧ = Объект.РаботаССекретностью.Добавить();
		
		// Заполнение		  
		СтрокаТЧ.Сотрудник = Справочники.Сотрудники.НайтиПоКоду(МассивСтроки[0]);
		СтрокаТЧ.Дата = СтроковыеФункцииКлиентСервер.СтрокаВДату(МассивСтроки[1]);
		// в Справочнике Идентификатор должен быть Заполнен!
		СтрокаТЧ.СтепеньСекретности = Справочники.СтепениСекретности.НайтиПоРеквизиту("Идентификатор",МассивСтроки[2]); 
		
		НомерСтроки = НомерСтроки + 1;		  
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	ЗаполнитьИзФайлаНаСервере();
КонецПроцедуры                  



