

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проведение документа
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РасчетЗарплатыРасширенный.ЗарегистрироватьЗначенияРазовыхПоказателейСотрудников(Движения, 
		Организация, РазовыеПоказатели());
	РасчетЗарплатыРасширенный.ЗарегистрироватьЗначенияРазовыхПоказателейСотрудников(Движения, 
		Организация, РазовыеПоказателиНатуральныйДоход());
	
	
КонецПроцедуры 


Функция  РазовыеПоказатели()
	
	
	//	РазовыеПоказатели - таблица значений с колонками.
	//		ПериодДействия
	//		Сотрудник - СправочникСсылка.Сотрудники
	//		Показатель - СправочникСсылка.ПоказателиРасчетаЗарплаты
	//		Значение - число
	
	
	// Менеджер ВТ	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц ;
	
	// Получение Списка Сотрудников
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелефоныСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.СчетНаОплатуУслугСвязи.Расходы КАК СчетНаОплатуУслугСвязиРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефоныСотрудников КАК ТелефоныСотрудников
	|		ПО СчетНаОплатуУслугСвязиРасходы.ТелефонныйНомер = ТелефоныСотрудников.ТелефонныйНомер
	|ГДЕ
	|	СчетНаОплатуУслугСвязиРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	
	// Получение в ВТ Кадровых Данных Сотрудников
	КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, Истина, 
	МассивСотрудников,"Должность, ГрафикРаботы, ВидЗанятости", КонецМесяца(Месяц)); 
	
	// получение в Запросе таблицы с Разовыми Показателями
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ЛимитыОплатыМобильнойСвязи.Лимит, 0) КАК Лимит
	|ПОМЕСТИТЬ ВТ_Лимиты
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыОплатыМобильнойСвязи КАК ЛимитыОплатыМобильнойСвязи
	|		ПО ВТКадровыеДанныеСотрудников.Должность = ЛимитыОплатыМобильнойСвязи.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СчетНаОплатуУслугСвязиРасходы.Ссылка.Месяц, МЕСЯЦ) КАК ПериодДействия,
	|	ТелефоныСотрудников.Сотрудник КАК Сотрудник,
	|	СчетНаОплатуУслугСвязиРасходы.Ссылка.Показатель КАК Показатель,
	|	СУММА(ВЫБОР
	|			КОГДА ТелефоныСотрудников.ТелефонРодственника
	|				ТОГДА СчетНаОплатуУслугСвязиРасходы.Сумма
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СчетНаОплатуУслугСвязиРасходы.Сумма > ВТ_Лимиты.Лимит
	|						ТОГДА СчетНаОплатуУслугСвязиРасходы.Сумма - ВТ_Лимиты.Лимит
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК Значение
	|ИЗ
	|	Документ.СчетНаОплатуУслугСвязи.Расходы КАК СчетНаОплатуУслугСвязиРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефоныСотрудников КАК ТелефоныСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Лимиты КАК ВТ_Лимиты
	|			ПО ТелефоныСотрудников.Сотрудник = ВТ_Лимиты.Сотрудник
	|		ПО СчетНаОплатуУслугСвязиРасходы.ТелефонныйНомер = ТелефоныСотрудников.ТелефонныйНомер
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТелефоныСотрудников.ТелефонРодственника
	|				ТОГДА СчетНаОплатуУслугСвязиРасходы.Сумма
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СчетНаОплатуУслугСвязиРасходы.Сумма > ВТ_Лимиты.Лимит
	|						ТОГДА СчетНаОплатуУслугСвязиРасходы.Сумма - ВТ_Лимиты.Лимит
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ > 0
	|	И СчетНаОплатуУслугСвязиРасходы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СчетНаОплатуУслугСвязиРасходы.Ссылка.Месяц, МЕСЯЦ),
	|	СчетНаОплатуУслугСвязиРасходы.Ссылка.Показатель,
	|	ТелефоныСотрудников.Сотрудник";
	
	
	// возврат таблицы с Разовыми Показателями
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции  


Функция  РазовыеПоказателиНатуральныйДоход()
	
	
	//	РазовыеПоказатели - таблица значений с колонками.
	//		ПериодДействия
	//		Сотрудник - СправочникСсылка.Сотрудники
	//		Показатель - СправочникСсылка.ПоказателиРасчетаЗарплаты
	//		Значение - число
	
	
	// Менеджер ВТ	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц ;
	
	// Получение Списка Сотрудников
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелефоныСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.СчетНаОплатуУслугСвязи.Расходы КАК СчетНаОплатуУслугСвязиРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефоныСотрудников КАК ТелефоныСотрудников
	|		ПО СчетНаОплатуУслугСвязиРасходы.ТелефонныйНомер = ТелефоныСотрудников.ТелефонныйНомер
	|ГДЕ
	|	СчетНаОплатуУслугСвязиРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	
	// Получение в ВТ Кадровых Данных Сотрудников
	КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, Истина, 
	МассивСотрудников,"Должность, ГрафикРаботы, ВидЗанятости", КонецМесяца(Месяц)); 
	
	// получение в Запросе таблицы с Разовыми Показателями
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(ЛимитыОплатыМобильнойСвязи.Лимит, 0) КАК Лимит
	               |ПОМЕСТИТЬ ВТ_Лимиты
	               |ИЗ
	               |	ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыОплатыМобильнойСвязи КАК ЛимитыОплатыМобильнойСвязи
	               |		ПО ВТКадровыеДанныеСотрудников.Должность = ЛимитыОплатыМобильнойСвязи.Должность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(СчетНаОплатуУслугСвязиРасходы.Ссылка.Месяц, МЕСЯЦ) КАК ПериодДействия,
	               |	ТелефоныСотрудников.Сотрудник КАК Сотрудник,
	               |	СчетНаОплатуУслугСвязиРасходы.Ссылка.ПоказательНатуральногоДохода КАК Показатель,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТелефоныСотрудников.ТелефонРодственника
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА СчетНаОплатуУслугСвязиРасходы.Сумма > ВТ_Лимиты.Лимит
	               |						ТОГДА ВТ_Лимиты.Лимит
	               |					ИНАЧЕ СчетНаОплатуУслугСвязиРасходы.Сумма
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК Значение
	               |ИЗ
	               |	Документ.СчетНаОплатуУслугСвязи.Расходы КАК СчетНаОплатуУслугСвязиРасходы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефоныСотрудников КАК ТелефоныСотрудников
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Лимиты КАК ВТ_Лимиты
	               |			ПО ТелефоныСотрудников.Сотрудник = ВТ_Лимиты.Сотрудник
	               |		ПО СчетНаОплатуУслугСвязиРасходы.ТелефонныйНомер = ТелефоныСотрудников.ТелефонныйНомер
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТелефоныСотрудников.ТелефонРодственника
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА СчетНаОплатуУслугСвязиРасходы.Сумма > ВТ_Лимиты.Лимит
	               |						ТОГДА ВТ_Лимиты.Лимит
	               |					ИНАЧЕ СчетНаОплатуУслугСвязиРасходы.Сумма
	               |				КОНЕЦ
	               |		КОНЕЦ > 0
	               |	И СчетНаОплатуУслугСвязиРасходы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(СчетНаОплатуУслугСвязиРасходы.Ссылка.Месяц, МЕСЯЦ),
	               |	ТелефоныСотрудников.Сотрудник,
	               |	СчетНаОплатуУслугСвязиРасходы.Ссылка.ПоказательНатуральногоДохода";
	
	
	// возврат таблицы с Разовыми Показателями
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции


