

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проведение документа
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РасчетЗарплатыРасширенный.ЗарегистрироватьЗначенияРазовыхПоказателейСотрудников(Движения, Организация, РазовыеПоказатели());
	
	
	
КонецПроцедуры 




Функция  РазовыеПоказатели()
	
	
	//	РазовыеПоказатели - таблица значений с колонками.
	//		ПериодДействия
	//		Сотрудник - СправочникСсылка.Сотрудники
	//		Показатель - СправочникСсылка.ПоказателиРасчетаЗарплаты
	//		Значение - число
	

	// Менеджер ВТ	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц ;
	
	// Получение Списка Сотрудников
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелефоныСотрудников.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.СчетНаОплатуУслугСвязи.Расходы КАК СчетНаОплатуУслугСвязиРасходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефоныСотрудников КАК ТелефоныСотрудников
		|		ПО СчетНаОплатуУслугСвязиРасходы.ТелефонныйНомер = ТелефоныСотрудников.ТелефонныйНомер
		|ГДЕ
		|	СчетНаОплатуУслугСвязиРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	
	// Получение в ВТ Кадровых Данных Сотрудников
	
	//КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, Истина, 
	//	МассивСотрудников,"Должность", КонецМесяца(Месяц));
	КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, Истина, 
		МассивСотрудников,"Должность, ГрафикРаботы, ВидЗанятости", КонецМесяца(Месяц)); 
	
	// получение в Запросе таблицы с Разовыми Показателями
	
	
	// возврат таблицы с Разовыми Показателями

КонецФункции

