
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Фиксация Движений
	Движения.Записать();
	
	
	ДанныеОВремени = ДанныеОВремени();
	УчетРабочегоВремени.ПроверитьРегистрируемыеДанныхОВремени(Ссылка, ДанныеОВремени, Отказ, Истина);
	УчетРабочегоВремени.ЗарегистрироватьРабочееВремяСотрудников(Движения, ДанныеОВремени);
	
	
	
КонецПроцедуры


Функция ДанныеОВремени()
	
	
	// Вариант № 1.  ВСЕ Виды Времени ДНЯ конкретного Дня ЗАРАНЕЕ известны 
	
	ТаблицаДанных = УчетРабочегоВремениРасширенный.ПустаяТаблицаДляРегистрацииВремени();
	
	Для Каждого СтрокаТабличнойЧасти Из ОтчетОВремени Цикл 
		
		//Работа в Лаборатории
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		СтрокаТаблицы.Дата = СтрокаТабличнойЧасти.Дата;
		СтрокаТаблицы.Сотрудник = СтрокаТабличнойЧасти.Сотрудник;
		СтрокаТаблицы.ВидВремени = ВидВремени;
		СтрокаТаблицы.Дней = 1;
		СтрокаТаблицы.Часов = (СтрокаТабличнойЧасти.ВремяВыхода - СтрокаТабличнойЧасти.ВремяВхода) / 3600;
		СтрокаТаблицы.Организация = Организация;
		
		
		// явка
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		СтрокаТаблицы.Дата = СтрокаТабличнойЧасти.Дата;
		СтрокаТаблицы.Сотрудник = СтрокаТабличнойЧасти.Сотрудник; 
		// любой  из вариантов  получения предопределенного 
		//СтрокаТаблицы.ВидВремени = Справочники.ВидыИспользованияРабочегоВремени.Явка;
		СтрокаТаблицы.ВидВремени = 
			ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Явка");

		СтрокаТаблицы.Дней = 1;
		СтрокаТаблицы.Часов = 8 - (СтрокаТабличнойЧасти.ВремяВыхода - СтрокаТабличнойЧасти.ВремяВхода) / 3600;
		СтрокаТаблицы.Организация = Организация;
	
		
		
	КонецЦикла;
	
	
	Возврат ТаблицаДанных;  
	
	// Вариант № 2. Предварительно необходимо получить Рабочее Время Сотрудника 
	
	
	
	
КонецФункции
