
// только измененные Процедуры

Процедура ЗаполнитьЗначенияДополнительныхПоказателейПоТаблицеЗначений(ДополнительныеПоказатели, ЗначенияПоказателей, МенеджерРасчета) Экспорт
	
	
КонецПроцедуры


Процедура ПриОпределенииДополнительныхПоказателей(ДополнительныеПоказатели) Экспорт
	
	Показатель = ЗарплатаКадрыРасширенный.ПоказательПоИдентификатору("_КоличествоЧасовВыполненияВредныхРабот");
	
	Если Показатель <> Неопределено Тогда
		
		ДополнительныеПоказатели.Добавить(Показатель);
			
	КонецЕсли
	
КонецПроцедуры
